app/controllers/api/sessions_controller.rb

SELECT  "seventh_levels".* FROM "seventh_levels" WHERE "seventh_levels"."user_id" = $1 ORDER BY "seventh_levels"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def create

    @user = User.find_by_credentials(params[:user][:email], params[:user][:password])
    @seventh_level = @user.seventh_levels.last