app/controllers/api/seventh_levels_controller.rb

  def show
    @seventh_level = SeventhLevel.find(params[:id])
---
SELECT  "seventh_levels".* FROM "seventh_levels" WHERE "seventh_levels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @seventh_level = current_user.seventh_levels.new(seventh_level_params)
    if @seventh_level.save
---
INSERT INTO "seventh_levels" ("phrase", "core1", "core2", "core3", "core4", "core5", "action1", "question1", "goal1", "action2", "question2", "goal2", "action3", "question3", "goal3", "action4", "question4", "goal4", "action5", "question5", "goal5", "action6", "question6", "goal6", "action7", "question7", "goal7", "user_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31) RETURNING "id"

  def update
    @seventh_level = SeventhLevel.find(params[:id])
    if @seventh_level.update(seventh_level_params)
      # if @seventh_level.update_attribute([attr]: seventh_level_params[attr])
      # update_attributes/update_attribute
      # commented this out for now because it was giving errors - Jess
      current_user.recent_seventh_level_id = @seventh_level.id
      current_user.save
---
SELECT  "seventh_levels".* FROM "seventh_levels" WHERE "seventh_levels"."id" = $1 LIMIT $2  [["id", -1], ["LIMIT", 1]]
UPDATE "seventh_levels" SET "action1" = $1, "question1" = $2, "updated_at" = $3 WHERE "seventh_levels"."id" = $4  [["action1", "Does this work always?"], ["question1", "Has this saved since last time"], ["updated_at", "2019-02-19 16:12:14.592629"], ["id", 2]]
UPDATE "users" SET "recent_seventh_level_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["recent_seventh_level_id", 2], ["updated_at", "2019-02-19 16:11:35.244106"], ["id", 1]]