app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "session_token", "created_at", "updated_at", "organization") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "seventh_levels" ("phrase", "core1", "core2", "core3", "core4", "core5", "action1", "question1", "goal1", "action2", "question2", "goal2", "action3", "question3", "goal3", "action4", "question4", "goal4", "action5", "question5", "goal5", "action6", "question6", "goal6", "action7", "question7", "goal7", "user_id", "created_at", "updated_at", "notes", "title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save
      @user.seventh_levels += [SeventhLevel.create({
        :title => '',
        :phrase => '',
        :core1 => '',
        :core2 => '',
        :core3 => '',
        :core4 => '',
        :core5 => '',
        :action1 => '',
        :question1 => '',
        :goal1 => '',
        :action2 => '',
        :question2 => '',
        :goal2 => '',
        :action3 => '',
        :question3 => '',
        :goal3 => '',
        :action4 => '',
        :question4 => '',
        :goal4 => '',
        :action5 => '',